garyPenhook/PyAvrOCD/svd/atmega3208.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SIGROW</name>
      <description>Signature row</description>
      <baseAddress>0x00801100</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xD</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2F</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CHECKSUM1</name>
          <description>CRC Checksum Byte 1</description>
          <addressOffset>0x2F</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DEVICEID0</name>
          <description>Device ID Byte 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DEVICEID1</name>
          <description>Device ID Byte 1</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DEVICEID2</name>
          <description>Device ID Byte 2</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OSC16ERR3V</name>
          <description>OSC16 error at 3V</description>
          <addressOffset>0x22</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OSC16ERR5V</name>
          <description>OSC16 error at 5V</description>
          <addressOffset>0x23</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OSC20ERR3V</name>
          <description>OSC20 error at 3V</description>
          <addressOffset>0x24</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OSC20ERR5V</name>
          <description>OSC20 error at 5V</description>
          <addressOffset>0x25</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OSCCAL16M0</name>
          <description>Oscillator Calibration 16 MHz Byte 0</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OSCCAL16M1</name>
          <description>Oscillator Calibration 16 MHz Byte 1</description>
          <addressOffset>0x19</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OSCCAL20M0</name>
          <description>Oscillator Calibration 20 MHz Byte 0</description>
          <addressOffset>0x1A</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OSCCAL20M1</name>
          <description>Oscillator Calibration 20 MHz Byte 1</description>
          <addressOffset>0x1B</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OSCCAL32K</name>
          <description>Oscillator Calibration for 32kHz ULP</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM0</name>
          <description>Serial Number Byte 0</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM1</name>
          <description>Serial Number Byte 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM2</name>
          <description>Serial Number Byte 2</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM3</name>
          <description>Serial Number Byte 3</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM4</name>
          <description>Serial Number Byte 4</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM5</name>
          <description>Serial Number Byte 5</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM6</name>
          <description>Serial Number Byte 6</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM7</name>
          <description>Serial Number Byte 7</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM8</name>
          <description>Serial Number Byte 8</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM9</name>
          <description>Serial Number Byte 9</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TEMPSENSE0</name>
          <description>Temperature Sensor Calibration Byte 0</description>
          <addressOffset>0x20</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TEMPSENSE1</name>
          <description>Temperature Sensor Calibration Byte 1</description>
          <addressOffset>0x21</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
